<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"e95acd72e374b0529dea4cf985053c9a106b96a337719203875372b6bee0ed00","plan_job_ref":"Job Terraform PRs for Azure #8 at https://github.com/acm-uic/IaC/actions/runs/4401320062","plan_hash":"bc0ac92cb6d7ba2b5977c8e19b3e2e3400850ed6080cf3116abe9500ac0a020f","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __azure/terraform/stacks/acm-general__ in the __prod__ workspace
With var files: `azure/terraform/stacks/acm-general/configuration/prod.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.terraform_sysadmin_demo will be created
  + resource "azuread_application" "terraform_sysadmin_demo" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "terraform-sysadmindemo-svc"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "21ec2c63-534d-4cfb-bc43-83773ce40e54",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # azuread_service_principal.terraform_sysadmin_demo will be created
  + resource "azuread_service_principal" "terraform_sysadmin_demo" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = (known after apply)
      + application_tenant_id        = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "21ec2c63-534d-4cfb-bc43-83773ce40e54",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azuread_service_principal_password.terraform_sysadmin_demo will be created
  + resource "azuread_service_principal_password" "terraform_sysadmin_demo" {
      + display_name         = "rbac-sysadmindemo"
      + end_date             = (known after apply)
      + end_date_relative    = "240h"
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform PRs for Azure #8](https://github.com/acm-uic/IaC/actions/runs/4401320062)